IDENTIFICATION DIVISION.
PROGRAM-ID. CONTOH.
AUTHOR. SAYA.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-PC.
OBJECT-COMPUTER. IBM-PC.
DATA DIVISION.
WORKINT-STORAGE SECTION.
01 MASUKAN.
  02 NAMA PIC X(20).
  02 NPM PIC X(8).
SCREEN SECTION.
01 HAPUS-LAYAR.
  02 BLANK SCREEN.
PROCEDURE DIVISION.
MASUKKAN-DATA.
DISPLAY HAPUS-LAYAR.
DISPLAY 'NAMA : '.
ACCEPT NAMA.
DISPLAY 'NPM :'.
ACCEPT NPM
SELESAI.
STOP RUN.
