  IDENTIFICATION DIVISION.
  PROGRAM-ID. PICTURE-EDITING.
  ENVIRONMENT DIVISION.
  DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 DATA-SUMBER.
        02 NAMA         PIC A(10).
        02 TANGGAL      PIC X(6).
        02 HARGA        PIC 9(6).
        02 BIAYA        PIC 9(6).
  01 DATA-EDIT.
        02 NAMA-OUT     PIC A(5)BA(5).
        02 TANGGAL-OUT  PIC XX/XX/XX.
        02 HARGA-OUT    PIC $Z(6).
        02 BIAYA-OUT    PIC ******.
  SCREEN SECTION.
  01 HAPUS-LAYAR.
        02 BLANK SCREEN.
  PROCEDURE DIVISION.
  MULAI.
        DISPLAY HAPUS-LAYAR.
        DISPLAY (2,1) 'NAMA ANDA : '. ACCEPT NAMA.
        MOVE NAMA TO NAMA-OUT.
        DISPLAY (3,1) 'TANGGAL   : '. ACCEPT TANGGAL.
        MOVE TANGGAL TO TANGGAL-OUT.
        DISPLAY (4,1) 'HARGA     : '. ACCEPT HARGA.
        MOVE HARGA TO HARGA-OUT.
        DISPLAY (5,1) 'BIAYA     : '. ACCEPT BIAYA.
        MOVE BIAYA TO BIAYA-OUT.
        DISPLAY HAPUS-LAYAR. DISPLAY NAMA-OUT.
        DISPLAY TANGGAL-OUT. DISPLAY HARGA-OUT.
        DISPLAT BIAYA-OUT.
  SELESAI.
        STOP RUN.
