       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERTEMUAN-SATU.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       * Deklarasi variable *
       01 LUAS-SEGITIGA.
           02 LUAS PIC Z(9).
           02 ALAS PIC 9999.
           02 TINGGI PIC 9999.
       PROCEDURE DIVISION.
           BISMILLAH.
               DISPLAY "MASUKAN TINGGI : ", ACCEPT TINGGI.
               DISPLAY "MASUKAN ALAS :", ACCEPT ALAS.
               COMPUTE LUAS = TINGGI * ALAS / 2.
               DISPLAY LUAS.
       END PROGRAM PERTEMUAN-SATU.
